alert("Сейчас будет ошибка") // тут треба було поставить точку з запятой

[1, 2].forEach(alert)

alert("Теперь всё в порядке"); // тут ми поставили і все працює

[1, 2].forEach(alert)

// Со временем программы становятся всё сложнее и сложнее.
// Возникает необходимость добавлять комментарии, которые бы описывали,
// что делает код и почему.
// Комментарии могут находиться в любом месте скрипта.
// Они не влияют на его выполнение, поскольку движок просто игнорирует их.

/* Пример с двумя сообщениями.
Это - многострочный комментарий.
*/
alert('Привет');
alert('Мир');

//Многострочные комментарии начинаются косой чертой со звёздочкой
/* и заканчиваются звёздочкой с косой чертой */